; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		r d v i s f h n g a b - block
	)
	(:init
		(handempty)
		(clear r)
		(on r d)
		(on d v)
		(ontable v)
		(clear i)
		(on i s)
		(on s f)
		(ontable f)
		(clear h)
		(ontable h)
		(clear n)
		(on n g)
		(on g a)
		(on a b)
		(ontable b)
	)
	(:goal (and
		;; banish
		(clear b) (ontable h) (on b a) (on a n) (on n i) (on i s) (on s h)
	))
)

; plan
1. (unstack i s)
   deleted: (clear i) (handempty) (on i s)
   added: (holding i) (clear s)
   goals met: 1 of 7
2. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 1 of 7
3. (unstack s f)
   deleted: (clear s) (handempty) (on s f)
   added: (holding s) (clear f)
   goals met: 1 of 7
4. (stack s h)
   deleted: (holding s) (clear h)
   added: (clear s) (handempty) (on s h)
   goals met: 2 of 7
5. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 2 of 7
6. (stack i s)
   deleted: (holding i) (clear s)
   added: (clear i) (handempty) (on i s)
   goals met: 3 of 7
7. (unstack n g)
   deleted: (clear n) (handempty) (on n g)
   added: (holding n) (clear g)
   goals met: 3 of 7
8. (stack n i)
   deleted: (holding n) (clear i)
   added: (clear n) (handempty) (on n i)
   goals met: 4 of 7
9. (unstack g a)
   deleted: (clear g) (handempty) (on g a)
   added: (holding g) (clear a)
   goals met: 4 of 7
10. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 4 of 7
11. (unstack a b)
   deleted: (clear a) (handempty) (on a b)
   added: (holding a) (clear b)
   goals met: 5 of 7
12. (stack a n)
   deleted: (holding a) (clear n)
   added: (clear a) (handempty) (on a n)
   goals met: 6 of 7
13. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 5 of 7
14. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (handempty) (on b a)
   goals met: 7 of 7
